---
layout: post
title: Visual studio
---  

얄팍한 사용법.   
* 기본 단축키만 사용함   
* 개인적으로 많이 쓰는 순서대로 정리    

# 찾기 #
ctrl + f를 누르면 현재문서가 기본인 찾기를 열 수 있다.
아래로 가르키는 화살표를 열면 바꾸기 기능이 있다.

# 찾기 및 바꾸기 #
ctrl + shift + f를 눌러보고 찾기 결과를 보자. 사용되는 결과를 볼 수 있다.

# 주석 처리, 주석 제거 #
우측 상단에 보면 단축키가 있다.
ctrl + k, ctrl + c를 누르면 주석처리가 된다.
반대로 ctrl + k, ctrl + u를 누르면 주석이 제거된다.

# 정의부로 이동 및 선언부로 이동 #
F12를 누르면 정의부에서 선언부로 선언부에서 정의부로 이동 가능하다.
ctrl + F12는 정의부로 이동할 수 있다.
alt + F12는 현재 열려있는 창에서 작은 편집 창을 열 수 있다.

# 새창 및 나누기 #
나누기는 잘 사용하지 않지만, 필요에 따라서 현재 열려져 있는 창에서 새창을 열 수 있다.
메뉴의 창에 있다.

# 보기 #
메뉴의 보기에 유용한 기능들이 많다.

# 밀어내기 또는 올리기 #
Alt + 화살표를 이용해서, 코드를 위 아래로 밀어 낼 수 있다.

# 빠른 작업 및 리팩토링 #   
ctrl + .을 눌러보자. 빠른 작업 및 리팩토링으로 들어갈 수 있다. (우클릭으로도 들어 갈 수 있다.)

# 멀티라인 에디팅 #   
ctrl + shift를 누르고 라인을 드래그 하고 작성해 보자.
커서에서 화살표 위아래로도 가능하다.

# Git branch #
깃을 연결하고 브런치 관리를 보면, 이쁜 브런치를 볼 수 있다.

# 책갈피 #
단축키는 ctrl + k, ctrl + k로 추가.
책갈피 창에서 이름을 바꿀 수 있다.
ctrl + k, ctrl + n으로 다음 책갈피로 이동.
ctrl + k, ctrl + p로 이전 책갈피로 이동할 수 있다.   
* 창을 여러개 키고 이동하고 싶지 않다면 책갈피가 도움이 될 지도 모르겠다.